#+TITLE: Notes on Algorithms and Data Structures
#+AUTHOR: P. Schreiber

*** Insertion sort

The insertion sort algorithm compares every element with the previous element,
and inserts it in the correct place. For that, it employs a nested loop.

#+BEGIN_SRC C
  #include <stdio.h>

  int main() {
    int arr[10] = {4,7,2,1,8,9,0,6,3,5};

    for (int i = 1; i < 10; i++) {
      int key = arr[i];
      int j = i - 1;
      while (j >= 0 && arr[j] > key) {
        arr[j + 1] = arr[j];
        j--;
      }
      arr[j + 1] = key;
    }
    
    for (int i = 0; i < 10; i++){
      printf("%d ", arr[i]);
    }
    return 0;
  }

#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9

- best case :: O(n)
- worst case :: O(n^{2})

*** Bubble sort

Bubble sort is the simplest algorithm to understand,
but it has the worst performance. The collection is iterated
sequentially, and each time an element is compared to its successor;
if arr[i] is greater than i[i+1], the elements are switched.

#+BEGIN_SRC C
  #include <stdio.h>

  int main(){
    int arr[10] = {4,7,2,1,8,9,0,6,3,5};

    for (int i = 0; i < 10 - 1; i++) {
      for (int j = 0; j < 10 - i; j++){
        if (arr[j] > arr[j + 1]) {
          int temp = arr[j + 1];
          arr[j + 1] = arr[j];
          arr[j] = temp;
        }
      }
    }

    for (int i = 0; i < 10; i++){
      printf("%d ", arr[i]);
    }
    return 0;
  }

#+END_SRC

#+RESULTS:
: 0 1 2 3 4 5 6 7 8 9

